<?php
/**
 * Подключаем файл
 */
include '../app/vendor/autoload.php';
/**
 * Инициализация объекта класса Init
 */
$init = new App\Acme\Init();

?><!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <title>Test</title>
    </head>
    <body>
        <h4>Нужно хранить свою библиотеку в БД. Хранятся только названия книг и авторы. У
                одной книги может быть несколько авторов, у одного автора может быть несколько книг.</h4>
        <h4>Предложите структуру таблиц и напишите SQL запрос получающий список книг, которые
                написаны 3-мя и более со-авторами (то есть получить отчет «книга — количество
                соавторов»).</h4>
        <?php

        $result = $init->get();

        /**
         * Вывод на страничку в виде таблицы
         */
        echo "<table border=1>
                <tr><th>Название книги</th><th>Количество соавторов</th></tr>";

                //вывод построчно
                for($i = 0; $i < count($result); $i++){
                        echo
                        "<tr>
                                <td>".$result[$i]['book_name']."</td>
                                <td>".$result[$i]['number']."</td>
                        </tr>";
                }
                        echo "</table>";

        ?>
    </body>
</html>
